results_590/vllm/minimax-m2.7/logs/MiniMax-M2.7-NVFP4_nvfp4_vllm_tp8_conc128_1k1k.log
/usr/local/lib/python3.12/dist-packages/torchvision/io/image.py:14: UserWarning: Failed to load image Python extension: 'Could not load this library: /usr/local/lib/python3.12/dist-packages/torchvision/image.so'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f73cdb00fe0>, seed=0, num_prompts=1280, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=128, model='lukealonso/MiniMax-M2.7-NVFP4', tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/root/.cache/huggingface/MiniMax-M2.7-NVFP4_nvfp4_vllm_tp8_conc128_1k1k.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-3e71aa4c-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, common_prefix_len=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
INFO 04-13 19:54:58 [datasets.py:612] Sampling input_len from [1024, 1024] and output_len from [1024, 1024]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:13 elapsed, 3098:18:34 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 128
100%|██████████| 1280/1280 [04:33<00:00,  4.67it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1280      
Failed requests:                         0         
Maximum request concurrency:             128       
Benchmark duration (s):                  273.96    
Total input tokens:                      1310720   
Total generated tokens:                  1310720   
Request throughput (req/s):              4.67      
Output token throughput (tok/s):         4784.35   
Peak output token throughput (tok/s):    5421.00   
Peak concurrent requests:                256.00    
Total token throughput (tok/s):          9568.70   
---------------Time to First Token----------------
Mean TTFT (ms):                          311.66    
Median TTFT (ms):                        291.45    
P99 TTFT (ms):                           1543.20   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          26.44     
Median TPOT (ms):                        26.59     
P99 TPOT (ms):                           28.04     
---------------Inter-token Latency----------------
Mean ITL (ms):                           26.42     
Median ITL (ms):                         25.05     
P99 ITL (ms):                            116.75    
==================================================